/*------------------------------------------------------------------------
 Module:       	ai.c
 Author:        helen
 Project:       
 State:			
 Creation Date:	2015-06-03
 Description:   
------------------------------------------------------------------------*/
/*------------------------------------------------------------------------
 $Rev: 7 $
------------------------------------------------------------------------*/

#include "syscfg.h"

#include "ai.h"


/*-------------------------------------------------------------------------------

---------------------------------------------------------------------------------
M4上应用：

根据AC板，YX,YK板的拨码组成AI和DI的拨码
比如AC1:02,AC2:03, AC3:04, 则AI拨码为0x432
0x00  没有插板卡

0xFF  未知型号，错误

0x01  3U18I				  

0x02  21I				  

--------------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------------
AD通道基准范围(基准值的3/4~5/4)
52259，自带AD
电压互感器 100-300V ~= 180000   100V取值范围 (135000, 225000)
电压互感器 100-电流 ~= 94000    100V取值范围 (70500, 117500)  FB1用
电流互感器 5-50A ~= 53000       5A取值范围 (39750, 66250)
电流互感器 5-10A ~= 269000      5A取值范围 (201750,336250)

5275, AD7606
电压互感器 100-300V ~= 696000   100V取值范围 (522000, 870000)
电流互感器 5-50A ~= 206000      5A取值范围 (154500, 257500)
电流互感器 5-10A

5275， AD7656
电压互感器 100-300V ~= 692000   100V取值范围 (519000, 865000)
电流互感器 5-50A ~= 205000      5A取值范围 (153750, 256250)
电流互感器 5-10A
--------------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------------
52259系列 AD采样Ic零漂有误差，其中FB1的Ia零漂也有误差
--------------------------------------------------------------------------------------*/
static struct VPYcCfg PYcCfg_Aio_Public[] = 
{
    {YC_TYPE_FDc, 0, 0, 0, 0, },
    {YC_TYPE_FDc, 0, 1, 0, 0, },
    {YC_TYPE_TEMETER, 0, 2, 0, 0, },
};
static VDefTVYcCfg PDefTVYcCfg_Aio_Public[] =
{
    {"Dc1",	   "Dc1",	  "V",    1,  0.01},
	{"Dc2",	   "Dc2",	  "V",    1,  0.01},
    {"T",      "T",       "°C",  1,  0.01},
};


#if defined(INCLUDE_YC)||defined(INCLUDE_EXT_YC)
static VDefTVYcCfg PDefTVYcCfg_Aio[] =
{
    {"Dc",        "Dc",         "",      1,  0.01},
    {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"Uo[%d]",    "Uo[%d]",     "V",     1,  0.01},
	{"Uo[%d]",    "Uo[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"Io[%d]",    "Io[%d]",	    "A",	  1,  0.0005},
	{"Io[%d]",    "Io[%d]",	    "A",	  1,  0.0005},

	{"Pa[%d]",    "Pa[%d]",	    "Kw",    0,  0.0000005},
	{"Pb[%d]",    "Pb[%d]",	    "Kw",    0,  0.0000005},
	{"Pc[%d]",    "Pc[%d]",	    "Kw",    0,  0.0000005},
	{"Qa[%d]",    "Qa[%d]",	    "Kvar",  0,  0.0000005},
	{"Qb[%d]",    "Qb[%d]",	    "Kvar",  0,  0.0000005},
	{"Qc[%d]",    "Qc[%d]",	    "Kvar",  0,  0.0000005},

	{"Uab[%d]",   "Uab[%d]",    "V",     1,  0.01},
	{"Ubc[%d]",   "Ubc[%d]",    "V",     1,  0.01},
	{"Uca[%d]",   "Uca[%d]",    "V",     1,  0.01},

	{"P[%d]",     "P[%d]",	     "Kw",    1,  0.0000005},
	{"Q[%d]",     "Q[%d]",	     "Kvar",  1,  0.0000005},
	{"S[%d]",     "S[%d]",	     "KVA",   1,  0.0000005},
	{"cosΦ[%d]", "cosΦ[%d]",	 "",      1,  0.001},
	{"工频",    "工频",	     "HZ",    1,  0.01},

	{"Ua[%d]",    "Ua[%d]",	     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",	     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",	     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",      "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	     "A",     1,  0.0005},

	{"Angle",     "Angle",	     "°",     1,  0.01},

	{"DC[%d]",    "DC[%d]",	     "v",     1,  0.001},
	{"工频",     "工频",	     "HZ",    1,  0.01},
    {"温度",     "温度",         " ℃",  1,  0.01},
};
#if ((DEV_SP == DEV_SP_TTU)||(DEV_SP == DEV_SP_DTU_IU))
static VDefTVYkCfg_Fd PDefTVYkCfg_Fd_Aio[] = 
{
	{"保留",  	"保留",     1},
	{"保留",  	"保留",     1},
	{"保留",    "保留",     1},
};
#else
static VDefTVYkCfg_Fd PDefTVYkCfg_Fd_Aio[] = 
{
	{"保护复归[%d]",   "保护复归[%d]",     1},
	{"软压板[%d]",     "软压板[%d]",       1},
	{"保留",           "保留",             1},
};
#endif
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/

		
#ifdef INCLUDE_YC
#if (DEV_SP == DEV_SP_TTU)
static VDefTVYxCfg_Fd PDefTVYxCfg_Aio_Public[] = 
{
	{"A相断相", 		"A相断相", 0},
	 {"B相断相",		 "B相断相", 0},
	 {"C相断相",		 "C相断相", 0},
	 {"A相失压",		 "A相失压", 0},
	 {"B相失压",		 "B相失压", 0},
	 {"C相失压",		 "C相失压", 0},
	 {"电压不平衡", 	 "电压不平衡", 0},
	 {"电流不平衡", 	 "电流不平衡", 0},
	{"停电",		   "停电", 0},
	{"过载",		   "过载", 0},
	{"重载",		   "重载", 0},
	{"恢复供电",	   "恢复供电", 0},
	{"UA越下限",	   "UA越下限", 0},
	{"UB越下限",	   "UB越下限", 0},
	{"UC越下限",	   "UC越下限", 0},
	{"UA越上限",	   "UA越上限", 0},
	{"UB越上限",	   "UB越上限", 0},
	{"UC越上限",	   "UC越上限", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
};
static VDefTVDdCfg PDefTVDdCfg_Aio[] = 
{
	{"正向有功[%d]",     "正向有功[%d]",	      "Kwh",  1, 0.01},
	{"正向无功[%d]",	   "正向无功[%d]",	      "Kvar", 1, 0.01},
	{"一象限无功[%d]",	 "一象限无功[%d]",	    "Kvar", 1, 0.01},
	{"四象限无功[%d]",	 "四象限无功[%d]",	    "Kvar", 1, 0.01}, 
	{"反向有功[%d]",	   "反向有功[%d]",	      "Kwh",  1, 0.01},
	{"反向无功[%d]",	   "反向无功[%d]",	      "Kvar",  1, 0.01}, 
	{"二象限无功[%d]",	 "二象限无功[%d]",	    "Kvar", 1, 0.01},
	{"三象限无功[%d]",	 "三象限无功[%d]",	    "Kvar", 1, 0.01},	

	{"15正向有功[%d]",   "15正向有功[%d]",	    "Kwh",  1, 0.01},
	{"15正向无功[%d]",	 "15正向无功[%d]",	    "Kvar", 1, 0.01},
	{"15一象限无功[%d]", "15一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"15四象限无功[%d]", "15四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"15反向有功[%d]",	 "15反向有功[%d]",	    "Kwh",  1, 0.01},
	{"15反向无功[%d]",	 "15反向无功[%d]",	    "Kvar",  1, 0.01}, 
	{"15二象限无功[%d]", "15二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"15三象限无功[%d]", "15三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"日正向有功[%d]",   "日正向有功[%d]",	    "Kwh",  1, 0.01},
	{"日正向无功[%d]",	 "日正向无功[%d][%d]",	"Kvar", 1, 0.01},
	{"日一象限无功[%d]", "日一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"日四象限无功[%d]", "日四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"日反向有功[%d]",	 "日反向有功[%d]",	    "Kwh",  1, 0.01},
	{"日反向无功[%d]",	 "日反向无功[%d]",	    "Kvar",  1, 0.01}, 
	{"日二象限无功[%d]", "日二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"日三象限无功[%d]", "日三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"潮流正向有功[%d]", "潮流正向有功[%d]",	  "Kwh",  1, 0.01},
	{"潮流正向无功[%d]", "潮流正向无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流一象限无功[%d]","潮流一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流四象限无功[%d]","潮流四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"潮流反向有功[%d]",	"潮流反向有功[%d]",	  "Kwh",  1, 0.01},
	{"潮流反向无功[%d]",	"潮流反向无功[%d]",	  "Kvar",  1, 0.01}, 
	{"潮流二象限无功[%d]","潮流二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流三象限无功[%d]","潮流三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"日总有功电量[%d]",  "日总有功电量[%d]",	  "Kwh",  1, 0.01},
	{"日总无功电量[%d]",  "日总无功电量[%d]",	  "Kvar", 1, 0.01},
	{"日尖段有功电量[%d]","日尖段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日尖段无功电量[%d]","日尖段无功电量[%d]",   "Kvar", 1, 0.01}, 
	{"日峰段有功电量[%d]",	"日峰段有功电量[%d]", "Kwh",  1, 0.01},
	{"日峰段无功电量[%d]",	"日峰段无功电量[%d]", "Kvar",  1, 0.01}, 
	{"日平段有功电量[%d]","日平段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日平段无功电量[%d]","日平段无功电量[%d]",   "Kvar", 1, 0.01},
	{"日谷段有功电量[%d]","日谷段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日谷段无功电量[%d]","日谷段无功电量[%d]",   "Kvar", 1, 0.01}, 

	
};
#else
#if ((TYPE_USER == USER_GUANGXI) || (TYPE_USER == USER_GUIYANG))
static VDefTVYxCfg_Fd PDefTVYxCfg_Aio_Public[] = 
{
    {"电源侧有压",     "电源侧有压", 0},
    {"负荷侧有压",     "负荷侧有压", 0},
    {"失电分闸",       "失电分闸", 0},
    {"得电合闸",       "得电合闸", 0},
    {"单侧失电合闸",   "单侧失电合闸", 0},
    {"合故障闭锁合",   "合故障闭锁合", 0},
    {"合成功闭锁分",   "合成功闭锁分", 0},
    {"合环动作",       "合环动作", 0},
	{"本地遥控合闸",   "本地遥控合闸", 0},
	{"零压",     	   "零压", 0},
	{"就地开关合闸",   "就地开关合闸", 0},
	{"远方遥控合闸",   "远方遥控合闸", 0},
	{"本地遥控分闸",   "本地遥控分闸", 0},
	{"就地开关分闸",   "就地开关分闸", 0},
	{"分段开关",       "分段开关", 0},
	{"联络开关",       "联络开关", 0},
	{"保护开关",       "保护开关", 0},
	{"连续分闸",       "连续分闸", 0},
	{"远方遥控分闸",   "远方遥控分闸", 0},
	{"联络分闸",       "联络分闸", 0},
	{"联络手合",       "联络手合", 0},
	{"联络手分",       "联络手分", 0},
	{"电源侧正向闭锁", "电源侧正向闭锁", 0},
	{"电源侧反向闭锁", "电源侧反向闭锁", 0},
	{"负荷侧正向闭锁", "负荷侧正向闭锁", 0},
	{"负荷侧反向闭锁", "负荷侧反向闭锁", 0},
	{"手分闭锁",       "手分闭锁", 0},
	{"瞬压闭锁",	   "瞬压闭锁", 0},
	{"合闸解锁",	   "合闸解锁", 0},
	{"复归解锁",	   "复归解锁", 0},
	{"得压解锁",	   "得压解锁", 0},
	{"联络得压解锁",   "联络得压解锁", 0},
};
#else
static VDefTVYxCfg_Fd PDefTVYxCfg_Aio_Public[] = 
{
    {"故障总",         "故障总", 0},
    {"保留",           "保留", 0},
    {"失电分闸",       "失电分闸", 0},
    {"得电合闸",       "得电合闸", 0},
    {"单侧失电合闸",   "单侧失电合闸", 0},
    {"合故障闭锁合",   "合故障闭锁合", 0},
    {"合成功闭锁分",   "合成功闭锁分", 0},
    {"合环动作",       "合环动作", 0},
	{"过流计数跳闸",   "过流计数跳闸", 0},
	{"零压跳闸",       "零压跳闸", 0},
	{"合闸正向闭锁",     "合闸正向闭锁", 0},
	{"合闸反向闭锁",     "合闸反向闭锁", 0},
	{"分闸正向闭锁",     "分闸正向闭锁", 0},
	{"分闸反向闭锁",     "分闸反向闭锁", 0},
	{"分段开关",     "分段开关", 0},
	{"联络开关",     "联络开关", 0},
	{"保护开关",     "保护开关", 0},
	{"分界开关",     "分界开关", 0},
	{"低电压",		   "低电压", 0},//{"保留",		   "保留", 0},
	{"过电压",		   "过电压", 0},//{"保留",		   "保留", 0},
#if (TYPE_USER == USER_BEIJING)
	{"辅开",		   "辅开", 0},
#else
	{"电源侧来电",		   "电源侧来电", 0},
#endif
	{"负荷侧来电",		   "负荷侧来电", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
	{"保留",		   "保留", 0},
#ifdef INCLUDE_FA_DIFF
	{"母线差动",		   "母线差动", 0},
#else
	{"保留",		   "保留", 0},
#endif
	{"双压闭锁合",		   "双压闭锁合", 0},
	{"瞬压闭锁合",		   "瞬压闭锁合", 0},
	{"残压闭锁合",		   "残压闭锁合", 0},
	{"手分闭锁合",		   "手分闭锁合", 0},
	{"多次得压闭锁合",		   "多次得压闭锁合", 0},
	{"接地故障跳闸",		   "接地故障跳闸", 0},
};
#endif
#if(DEV_SP == DEV_SP_DTU_IU)
static VDefTVDdCfg PDefTVDdCfg_Aio[] = 
{
	{"正向有功[%d]",     "正向有功[%d]",	      "Kwh",  1, 0.01},
	{"正向无功[%d]",	   "正向无功[%d]",	      "Kvar", 1, 0.01},
	{"一象限无功[%d]",	 "一象限无功[%d]",	    "Kvar", 1, 0.01},
	{"四象限无功[%d]",	 "四象限无功[%d]",	    "Kvar", 1, 0.01}, 
	{"反向有功[%d]",	   "反向有功[%d]",	      "Kwh",  1, 0.01},
	{"反向无功[%d]",	   "反向无功[%d]",	      "Kvar",  1, 0.01}, 
	{"二象限无功[%d]",	 "二象限无功[%d]",	    "Kvar", 1, 0.01},
	{"三象限无功[%d]",	 "三象限无功[%d]",	    "Kvar", 1, 0.01},	

	{"15正向有功[%d]",   "15正向有功[%d]",	    "Kwh",  1, 0.01},
	{"15正向无功[%d]",	 "15正向无功[%d]",	    "Kvar", 1, 0.01},
	{"15一象限无功[%d]", "15一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"15四象限无功[%d]", "15四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"15反向有功[%d]",	 "15反向有功[%d]",	    "Kwh",  1, 0.01},
	{"15反向无功[%d]",	 "15反向无功[%d]",	    "Kvar",  1, 0.01}, 
	{"15二象限无功[%d]", "15二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"15三象限无功[%d]", "15三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"日正向有功[%d]",   "日正向有功[%d]",	    "Kwh",  1, 0.01},
	{"日正向无功[%d]",	 "日正向无功[%d][%d]",	"Kvar", 1, 0.01},
	{"日一象限无功[%d]", "日一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"日四象限无功[%d]", "日四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"日反向有功[%d]",	 "日反向有功[%d]",	    "Kwh",  1, 0.01},
	{"日反向无功[%d]",	 "日反向无功[%d]",	    "Kvar",  1, 0.01}, 
	{"日二象限无功[%d]", "日二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"日三象限无功[%d]", "日三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"潮流正向有功[%d]", "潮流正向有功[%d]",	  "Kwh",  1, 0.01},
	{"潮流正向无功[%d]", "潮流正向无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流一象限无功[%d]","潮流一象限无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流四象限无功[%d]","潮流四象限无功[%d]",	  "Kvar", 1, 0.01}, 
	{"潮流反向有功[%d]",	"潮流反向有功[%d]",	  "Kwh",  1, 0.01},
	{"潮流反向无功[%d]",	"潮流反向无功[%d]",	  "Kvar",  1, 0.01}, 
	{"潮流二象限无功[%d]","潮流二象限无功[%d]",	  "Kvar", 1, 0.01},
	{"潮流三象限无功[%d]","潮流三象限无功[%d]",	  "Kvar", 1, 0.01},	

	{"日总有功电量[%d]",  "日总有功电量[%d]",	  "Kwh",  1, 0.01},
	{"日总无功电量[%d]",  "日总无功电量[%d]",	  "Kvar", 1, 0.01},
	{"日尖段有功电量[%d]","日尖段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日尖段无功电量[%d]","日尖段无功电量[%d]",   "Kvar", 1, 0.01}, 
	{"日峰段有功电量[%d]",	"日峰段有功电量[%d]", "Kwh",  1, 0.01},
	{"日峰段无功电量[%d]",	"日峰段无功电量[%d]", "Kvar",  1, 0.01}, 
	{"日平段有功电量[%d]","日平段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日平段无功电量[%d]","日平段无功电量[%d]",   "Kvar", 1, 0.01},
	{"日谷段有功电量[%d]","日谷段有功电量[%d]",   "Kwh", 1, 0.01},
	{"日谷段无功电量[%d]","日谷段无功电量[%d]",   "Kvar", 1, 0.01}, 
};
#else
static VDefTVDdCfg PDefTVDdCfg_Aio[] = 
{
	{"正向有功电能[%d]",     "+KWh[%d]",	  "Kwh",  1, 0.01},
	{"正向无功电能[%d]",	 "+KVr[%d]",	  "Kvar", 1, 0.01},
	{"反向有功电能[%d]",	 "-KWh[%d]",	  "Kwh",  1, 0.01},
	{"反向无功电能[%d]",	 "-KVr[%d]",	  "Kwh",  1, 0.01},    
};	
#endif
#endif


#if (TYPE_USER == USER_GUANGXI)
static VDefTVYxCfg_Fd PDefTVYxCfg_Fd_Aio[] = 
{
    {"事故总[%d]",        "事故总%d",       1},
    {"自动化投入[%d]",    "自动化投入%d",   1},
	{"加速跳投入[%d]",    "加速跳退出%d",     1},	
	{"I段过流[%d]",       "I段过流%d",      1},
	{"II段过流[%d]",	  "II段过流%d",     1},
 	{"III段过流[%d]",	  "III段过流%d",    1},
	{"A相过流[%d]",       "A相过流%d",      1},
	{"B相过流[%d]",	      "B相过流%d",      1},
 	{"C相过流[%d]",	      "C相过流%d",      1},
 	{"过负荷[%d]",		  "过负荷%d",       1},
	{"零流I段[%d]",		  "零流I段%d",      1},
	{"重合1投入[%d]",	  "重合1投入%d",    1},
	{"重合2投入[%d]",	  "重合2投入%d",    1},
	{"PT断线或失压[%d]",  "PT断线或失压%d", 1},
	{"过流失压[%d]",      "过流失压%d",     1},
	{"故障跳闸[%d]",	  "故障跳闸%d",     1},
	{"遥控软压板[%d]",	  "遥控软压板%d",     1},
	{"重合闸[%d]",		  "重合闸%d",       1},
	{"开关跳闸异常[%d]",  "开关跳闸异常%d", 1},
	{"开关合闸异常[%d]",  "开关合闸异常%d", 1},
	{"重合闸闭锁[%d]",	  "重合闸闭锁%d",   1},
	{"分闸闭锁[%d]",	  "分闸闭锁%d",     1},
	{"接地故障[%d]",	  "接地故障%d",     1},
	{"短路故障[%d]",	  "短路故障%d",     1},
    {"三相过流[%d]",      "三相过流%d",     1},
    {"零序II段[%d]",      "零序II段%d",     1},
    {"重合加速[%d]",      "重合加速%d",     1}, 
    {"过流I段投入[%d]",   "过流I段投入%d",     1},  
    {"过流II段投入[%d]",  "过流II段投入%d",     1},
    {"过流III段投入[%d]", "过流III段投入%d",     1},  
    {"零流I段投入[%d]",   "零流I段投入%d",     1},  
    {"零流II段投入[%d]",  "零流II段投入%d",     1},
};
#elif (TYPE_USER == USER_FUJIAN)
static VDefTVYxCfg_Fd PDefTVYxCfg_Fd_Aio[] =
{
	{"事故总[%d]",        "事故总%d",       1},
	{"事故总方向[%d]",    "事故总方向%d",   1},
	{"保护启动[%d]",      "保护启动%d",     1},	
	{"I段过流[%d]",       "I段过流%d",      1},
	{"II段过流[%d]",	  "II段过流%d",     1},
 	{"III段过流[%d]",	  "III段过流%d",    1},
	{"过流I段动作[%d]",       "过流I段动作%d",      1},
	{"过流II段动作[%d]",	      "过流II段动作%d",      1},
 	{"零序I段动作[%d]",	      "零序一段动作%d",      1},
 	{"过负荷[%d]",		  "过负荷%d",       1},
	{"零流[%d]",		  "零流%d",         1},
	{"低电压[%d]",		  "低电压%d",       1},
	{"过压保护动作[%d]",	      "过压保护动作%d",         1},
	{"PT断线或失压[%d]",  "PT断线或失压%d", 1},
	{"过流失压[%d]",      "过流失压%d",     1},
	{"故障跳闸[%d]",	  "故障跳闸%d",     1},
	{"遥控软压板[%d]",	  "遥控软压板%d",     1},
	{"重合闸[%d]",		  "重合闸%d",       1},
	{"开关跳合闸异常[%d]",  "开关跳合闸异常%d", 1},
	{"零流后加速动作[%d]",  "零流后加速动作%d", 1},
	{"重合闸闭锁[%d]",	  "重合闸闭锁%d",   1},
	{"分闸闭锁[%d]",	  "分闸闭锁%d",     1},
	{"重载[%d]",	      "重载%d",       1},
	{"过载[%d]",        "过载%d",       1},
	{"低频保护动作[%d]","低频保护动作%d",1},
	{"过流后加速动作[%d]",		  "过流后加速动作%d",         1},
	{"小电流接地[%d]",		  "小电流接地%d",         1},
	{"过流III段动作[%d]",    "过流III段动作%d",   1},
	{"过频保护动作[%d]",		  "过频保护动作%d",       1},
	{"线路有压[%d]",      "线路有压%d",     1},
	{"线路无压[%d]",      "线路无压%d",     1},
	{" 后加速[%d]",		  "后加速%d",       1},
};
 	
#else
static VDefTVYxCfg_Fd PDefTVYxCfg_Fd_Aio[] = 
{
    {"事故总[%d]",        "事故总%d",       1},
    {"事故总方向[%d]",    "事故总方向%d",   1},
	{"保护启动[%d]",      "保护启动%d",     1},	
	{"I段过流[%d]",       "I段过流%d",      1},
	{"II段过流[%d]",	  "II段过流%d",     1},
 	{"III段过流[%d]",	  "III段过流%d",    1},
	{"A相过流[%d]",       "A相过流%d",      1},
	{"B相过流[%d]",	      "B相过流%d",      1},
 	{"C相过流[%d]",	      "C相过流%d",      1},
 	{"过负荷[%d]",		  "过负荷%d",       1},
	{"零流[%d]",		  "零流%d",         1},
	{"低电压[%d]",		  "低电压%d",       1},
	{"过压[%d]",	      "过压%d",         1},
	{"PT断线或失压[%d]",  "PT断线或失压%d", 1},
	{"过流失压[%d]",      "过流失压%d",     1},
	{"故障跳闸[%d]",	  "故障跳闸%d",     1},
	{"遥控软压板[%d]",	  "遥控软压板%d",     1},
	{"重合闸[%d]",		  "重合闸%d",       1},
	{"开关跳合闸异常[%d]",  "开关跳合闸异常%d", 1},
	{"零序二段过流[%d]",  "零序二段过流%d", 1},
	{"重合闸闭锁[%d]",	  "重合闸闭锁%d",   1},
	{"分闸闭锁[%d]",	  "分闸闭锁%d",     1},
	{"重载[%d]",	      "重载%d",       1},
	{"过载[%d]",        "过载%d",       1},
	{"大电流闭锁重合[%d]","大电流闭锁重合%d",1},
#if (TYPE_USER == USER_BEIJING)
	{"零序I段过流[%d]",       "零序I段过流%d",      1},
#elif(TYPE_USER == USER_GUIYANG)
	{"自动化投入[%d]",		  "自动化投入%d",         1},
#else
	{"过流[%d]",		  "过流%d",         1},
#endif
	{"小电流接地[%d]",		  "小电流接地%d",         1},
#if (TYPE_USER == USER_BEIJING)
	{"零序II段过流[%d]",       "零序II段过流%d",      1},
	{"零序III段过流[%d]",       "零序III段过流%d",      1},
#else
	{"过频动作[%d]",		  "过频动作%d",         1},
#ifdef PR_ZJJH
	{"母线欠压[%d]",		  "母线欠压%d", 		1},
#else
	{"低频动作[%d]",		  "低频动作%d",         1},
#endif
#endif
    {"线路有压[%d]",      "线路有压%d",     1},
    {"线路无压[%d]",      "线路无压%d",     1},
	{" 后加速[%d]",		  "后加速%d",       1},
};	
#endif
#endif



#if ((DEV_SP == DEV_SP_FTU)||(DEV_SP == DEV_SP_CTRL))
static struct VPAiCfg PAiCfg_Aio_0x02[] = 
{
	{YC_TYPE_I0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x02[] = 
{
/*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 6, 0, 10, },
	{YC_TYPE_Uc,  0, 5, 0, 10, },
	{YC_TYPE_U0,  0, 7, 0, 10, },

	{YC_TYPE_Ia,  0, 1, 0, 10, },
	{YC_TYPE_Ib,  0, 2, 0, 10, },
	{YC_TYPE_Ic,  0, 3, 0, 10, },
	{YC_TYPE_I0,  0, 0, 0, 10, },
	
};

static struct VPFdCfg PFdCfg_Aio_0x02[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x02[] = 
{
    {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};

#endif

#if (DEV_SP == DEV_SP_WDG)
#if (TYPE_USER == USER_FUJIAN)
static struct VPAiCfg PAiCfg_Aio_0x03[] = 
{
	{YC_TYPE_I0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ua,   0, 0, 0, 0},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x03[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 4, 0, 10, },
	{YC_TYPE_Uc,  0, 6, 0, 10, },
	{YC_TYPE_U0,  0, 7, 0, 10, },

	{YC_TYPE_Ia,  0, 1, 0, 10, },
	{YC_TYPE_Ib,  0, 2, 0, 10, },
	{YC_TYPE_Ic,  0, 3, 0, 10, },
	{YC_TYPE_I0,  0, 0, 0, 10, },
        {YC_TYPE_Ub,  0, 5, 0, 10, },

};
static struct VPFdCfg PFdCfg_Aio_0x03[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};
static VDefTVYcCfg PDefTVYcCfg_Aio_0x03[] = 
{
    {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",    "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
       {"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
};	

#else
static struct VPAiCfg PAiCfg_Aio_0x03[] = 
{
	{YC_TYPE_I0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ua,   0, 0, 0, 0},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},

};

static struct VPYcCfg PYcCfg_Aio_0x03[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 4, 0, 10, },
	{YC_TYPE_Uc,  0, 6, 0, 10, },
	{YC_TYPE_U0,  0, 5, 0, 10, },

	{YC_TYPE_Ia,  0, 1, 0, 10, },
	{YC_TYPE_Ib,  0, 2, 0, 10, },
	{YC_TYPE_Ic,  0, 3, 0, 10, },
	{YC_TYPE_I0,  0, 0, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x03[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x03[] = 
{
    {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",    "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	
#endif
static struct VPAiCfg PAiCfg_Aio_0x04[] = 
{
	{YC_TYPE_I0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ua,   0, 0, 0, 0},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},

};

static struct VPYcCfg PYcCfg_Aio_0x04[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 4, 0, 10, },
	{YC_TYPE_Ub,  0, 7, 0, 10, },
	{YC_TYPE_Uc,  0, 6, 0, 10, },
	{YC_TYPE_U0,  0, 5, 0, 10, },

	{YC_TYPE_Ia,  0, 1, 0, 10, },
	{YC_TYPE_Ib,  0, 2, 0, 10, },
	{YC_TYPE_Ic,  0, 3, 0, 10, },
	{YC_TYPE_I0,  0, 0, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x04[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x04[] = 
{
    {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",    "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	

#endif

#if (DEV_SP == DEV_SP_TTU)
static struct VPAiCfg PAiCfg_Aio_0x04[] = 
{
	{YC_TYPE_Ua,   0, 0, 0,  0,},
	{YC_TYPE_Ub,   0, 0, 0,  0,},
	{YC_TYPE_Uc,   0, 0, 0,  0,},
	{YC_TYPE_U0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0, 0,},
	{YC_TYPE_Ic,   0, 0, 0, 0,},
	{YC_TYPE_I0,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x04[] = 
{
/*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 0, 0, 10, },
	{YC_TYPE_Ub,  0, 1, 0, 10, },
	{YC_TYPE_Uc,  0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,  0, 4, 0, 10, },
	{YC_TYPE_Ib,  0, 5, 0, 10, },
	{YC_TYPE_Ic,  0, 6, 0, 10, },
	{YC_TYPE_I0,  0, 7, 0, 10, },
	
};

static struct VPFdCfg PFdCfg_Aio_0x04[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x04[] = 
{
     {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};
#endif

#if (DEV_SP == DEV_SP_DTU_IU)
static struct VPAiCfg PAiCfg_Aio_0x08[] = 
{
	{YC_TYPE_Ua,   0, 0, 0,  0,},
	{YC_TYPE_Ub,   0, 0, 0,  0,},
	{YC_TYPE_Uc,   0, 0, 0,  0,},
	{YC_TYPE_U0,   0, 0, 0,  0,},
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0, 0,},
	{YC_TYPE_Ic,   0, 0, 0, 0,},
	{YC_TYPE_I0,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x08[] = 
{
/*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,  0, 0, 0, 10, },
	{YC_TYPE_Ub,  0, 1, 0, 10, },
	{YC_TYPE_Uc,  0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,  0, 4, 0, 10, },
	{YC_TYPE_Ib,  0, 5, 0, 10, },
	{YC_TYPE_Ic,  0, 6, 0, 10, },
	{YC_TYPE_I0,  0, 7, 0, 10, },
	
};

static struct VPFdCfg PFdCfg_Aio_0x08[] = 
{
    {"开关1", 101, 0x0, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x08[] = 
{
     {"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};
#endif

#if (DEV_SP == DEV_SP_DTU)
static struct VPAiCfg PAiCfg_Aio_0x01[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x01[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ib,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ib,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ib,   0, 16, 0, 10, },
	{YC_TYPE_Ic,   0, 17, 0, 10, },
	{YC_TYPE_SI0,  0, 20, 3, 10, },

	{YC_TYPE_Ia,  0,  18, 0, 10, },
	{YC_TYPE_Ib,  0,  19, 0, 10, },
	{YC_TYPE_Ic,  0,  20, 0, 10, },
	{YC_TYPE_SI0, 0,  24, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x01[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 106, 0x20, 220, 5, 10000, 600, 30, -1, 6, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x01[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
    
};	


static struct VPAiCfg PAiCfg_Aio_0x11[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x11[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ic,   0, 4, 0, 10, },
	{YC_TYPE_I0,   0, 5, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },

	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ic,   0, 16, 0, 10, },
	{YC_TYPE_I0,   0, 17, 0, 10, },
	{YC_TYPE_SIb,  0, 20, 21, 10, },

	{YC_TYPE_Ia,  0,  18, 0, 10, },
	{YC_TYPE_Ic,  0,  19, 0, 10, },
	{YC_TYPE_I0,  0,  20, 0, 10, },
	{YC_TYPE_SIb, 0,  24, 25, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x11[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 106, 0x20, 220, 5, 10000, 600, 30, -1, 6, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x11[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
    
};	


// 4U 16I
static struct VPAiCfg PAiCfg_Aio_0x21[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Null, 0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x21[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11,0, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },

	{YC_TYPE_Ia,   0, 16, 0, 10, },
	{YC_TYPE_Ib,   0, 17, 0, 10, },
	{YC_TYPE_Ic,   0, 18, 0, 10, },
	{YC_TYPE_I0,   0, 19, 0, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x21[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x21[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},    
};	


static struct VPAiCfg PAiCfg_Aio_0x02[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Dc,  0, 0, 0,  0,},
	{YC_TYPE_Dc,  0, 0, 0,  0,},
	{YC_TYPE_Dc,  0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x02[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_SI0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ib,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ib,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },
	
	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ib,   0, 16, 0, 10, },
	{YC_TYPE_Ic,   0, 17, 0, 10, },
	{YC_TYPE_SI0,  0, 20, 3, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x02[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
  {"开关[%d]", 106, 0x20, 220, 5, 10000, 600, 30, -1, 6, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x02[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	


static struct VPAiCfg PAiCfg_Aio_0x12[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,  0, 0, 0,  0,},
	{YC_TYPE_Dc,  0, 0, 0,  0,},
	{YC_TYPE_Dc,  0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x12[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ic,   0, 1, 0, 10, },
	{YC_TYPE_I0,   0, 2, 0, 10, },
	{YC_TYPE_SIb,  0, 0, 1, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ic,   0, 4, 0, 10, },
	{YC_TYPE_I0,   0, 5, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13,10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },
	
	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ic,   0, 16, 0, 10, },
	{YC_TYPE_I0,   0, 17, 0, 10, },
	{YC_TYPE_SIb,  0, 20, 21, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x12[] = 
{
	{"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 106, 0x20, 220, 5, 10000, 600, 30, -1, 6, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x12[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
};	


static struct VPAiCfg PAiCfg_Aio_0x22[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Null, 0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x22[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_I0,   0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10,0, 10, },
	{YC_TYPE_I0,   0, 11,0, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },

	{YC_TYPE_Ia,   0, 16, 0, 10, },
	{YC_TYPE_Ib,   0, 17, 0, 10, },
	{YC_TYPE_Ic,   0, 18, 0, 10, },
	{YC_TYPE_I0,   0, 19, 0, 10, },
	
};

static struct VPFdCfg PFdCfg_Aio_0x22[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x22[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	


static struct VPAiCfg PAiCfg_Aio_0x03[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x03[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ib,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ua,   0, 3, 0, 10, },
	{YC_TYPE_Ub,   0, 4, 0, 10, },
	{YC_TYPE_Uc,   0, 5, 0, 10, },
	{YC_TYPE_SU0,  0, 16, 3, 10, },
	
	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ib,   0, 16, 0, 10, },
	{YC_TYPE_Ic,   0, 17, 0, 10, },
	{YC_TYPE_SI0,  0, 20, 3, 10, },

	{YC_TYPE_Ia,  0,  18, 0, 10, },
	{YC_TYPE_Ib,  0,  19, 0, 10, },
	{YC_TYPE_Ic,  0,  20, 0, 10, },
	{YC_TYPE_SI0, 0,  24, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x03[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x03[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	

static struct VPAiCfg PAiCfg_Aio_0x13[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x13[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ua,   0, 3, 0, 10, },
	{YC_TYPE_Ub,   0, 4, 0, 10, },
	{YC_TYPE_Uc,   0, 5, 0, 10, },
	{YC_TYPE_SU0,  0, 16, 3, 10, },
	
	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ic,   0, 16, 0, 10, },
	{YC_TYPE_I0,   0, 17, 0, 10, },
	{YC_TYPE_SIb,  0, 20, 21, 10, },

	{YC_TYPE_Ia,  0,  18, 0, 10, },
	{YC_TYPE_Ic,  0,  19, 0, 10, },
	{YC_TYPE_I0,  0,  20, 0, 10, },
	{YC_TYPE_SIb, 0,  24, 25, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x13[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x13[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

};	

//8U12I
static struct VPAiCfg PAiCfg_Aio_0x23[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Null,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x23[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
	
	{YC_TYPE_Ua,   0, 4, 0, 10, },
	{YC_TYPE_Ub,   0, 5, 0, 10, },
	{YC_TYPE_Uc,   0, 6, 0, 10, },
	{YC_TYPE_U0,  0, 7,0, 10, },
	
	{YC_TYPE_Ia,   0, 16, 0, 10, },
	{YC_TYPE_Ib,   0, 17, 0, 10, },
	{YC_TYPE_Ic,   0, 18, 0, 10, },
	{YC_TYPE_I0,   0, 19, 0, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x23[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x23[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
};	

#ifdef _GUANGZHOU_TEST_FTU_
static struct VPAiCfg PAiCfg_Aio_0x42[] = 
{
    {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_U0,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_I0,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},

	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x42[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_I0,   0, 9, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x42[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x42[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
};	

#else
static struct VPAiCfg PAiCfg_Aio_0x42[] = 
{
    {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x42[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ib,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ua,   0, 3, 0, 10, },
	{YC_TYPE_Ub,   0, 4, 0, 10, },
	{YC_TYPE_Uc,   0, 5, 0, 10, },
	{YC_TYPE_SU0,  0, 12, 3, 10, },
	
	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x42[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x42[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	 
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	
#endif
static struct VPAiCfg PAiCfg_Aio_0x52[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x52[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0,  8, 9, 10, },

	{YC_TYPE_Ua,   0, 3, 0, 10, },
	{YC_TYPE_Ub,   0, 4, 0, 10, },
	{YC_TYPE_Uc,   0, 5, 0, 10, },
	{YC_TYPE_SU0,  0, 12, 3, 10, },
	
	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x52[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x52[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	 
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
};	

//8U8I
static struct VPAiCfg PAiCfg_Aio_0x62[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x62[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },

	{YC_TYPE_Ua,   0, 4, 0, 10, },
	{YC_TYPE_Ub,   0, 5, 0, 10, },
	{YC_TYPE_Uc,   0, 6, 0, 10, },
	{YC_TYPE_U0,  0, 7, 0, 10, },
	
	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x62[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x62[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	 
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

};	

static struct VPAiCfg PAiCfg_Aio_0x43[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};
static struct VPYcCfg PYcCfg_Aio_0x43[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_SI0,  0, 0, 3, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ib,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ib,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },
	

};

static struct VPFdCfg PFdCfg_Aio_0x43[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x43[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	
};	

static struct VPAiCfg PAiCfg_Aio_0x53[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};
static struct VPYcCfg PYcCfg_Aio_0x53[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ic,   0, 1, 0, 10, },
	{YC_TYPE_I0,   0, 2, 0, 10, },
	{YC_TYPE_SIb,  0, 0, 1, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ic,   0, 4, 0, 10, },
	{YC_TYPE_I0,   0, 5, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x53[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x53[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	
};	

static struct VPAiCfg PAiCfg_Aio_0x63[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Null, 0, 0, 0,  0,},
	{YC_TYPE_Null, 0, 0, 0,  0,},
	{YC_TYPE_Null, 0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};
static struct VPYcCfg PYcCfg_Aio_0x63[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_I0,   0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x63[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x63[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	
};	

static struct VPAiCfg PAiCfg_Aio_0x65[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
};
static struct VPYcCfg PYcCfg_Aio_0x65[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_I0,   0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
    
    {YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x65[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x65[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

     {"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
};	

#ifdef INCLUDE_PR_DIFF
static struct VPAiCfg PAiCfg_Aio_0x44[] = 
{
    {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},

	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x44[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },
	
	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ib,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_SI0,  0, 3, 3, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ib,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_SI0,  0, 6, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x44[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x44[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},


	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
      
};	

#else
static struct VPAiCfg PAiCfg_Aio_0x44[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x44[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ib,   0, 8, 0, 10, },
	{YC_TYPE_Ic,   0, 9, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ib,   0, 11, 0, 10, },
	{YC_TYPE_Ic,   0, 12, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ib,   0, 14, 0, 10, },
	{YC_TYPE_Ic,   0, 15, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x44[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x44[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
      
};	
#endif

static struct VPAiCfg PAiCfg_Aio_0x54[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x54[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_I0,   0, 6, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_I0,   0, 9, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_I0,   0, 12, 0, 10, },
	{YC_TYPE_SIb,  0, 12,13, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
	{YC_TYPE_SIb,  0, 16,17, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x54[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x54[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
      
};	

//4U12I
static struct VPAiCfg PAiCfg_Aio_0x64[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
};

static struct VPYcCfg PYcCfg_Aio_0x64[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x64[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x64[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",    "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},      
};

//3U4I
static struct VPAiCfg PAiCfg_Aio_0x45[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Dc,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x45[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_SU0,  0, 0, 3, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,  0, 7, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x45[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x45[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	
};	

// 0x46   8U
static struct VPAiCfg PAiCfg_Aio_0x46[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x46[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x46[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",	    "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",	    "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",	    "V",     1,  0.01},
};	

// 0x47   8I
static struct VPAiCfg PAiCfg_Aio_0x47[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},

	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x47[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ib,   0, 1, 0, 10, },
	{YC_TYPE_Ic,   0, 2, 0, 10, },
	{YC_TYPE_I0,   0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },
	
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
};

static struct VPFdCfg PFdCfg_Aio_0x47[] = 
{
	{"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x47[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.005},
	{"Ib[%d]",    "Ib[%d]",     "A",     1,  0.005},
	{"Ic[%d]",    "Ic[%d]",     "A",     1,  0.005},
	{"I0[%d]",    "I0[%d]",     "A",     1,  0.005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
};

static struct VPAiCfg PAiCfg_Aio_0x49[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x49[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ib,   0, 8, 0, 10, },
	{YC_TYPE_Ic,   0, 9, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ib,   0, 11, 0, 10, },
	{YC_TYPE_Ic,   0, 12, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ib,   0, 14, 0, 10, },
	{YC_TYPE_Ic,   0, 15, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x49[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x49[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
      
};	

//0X04 4U15I
static struct VPAiCfg PAiCfg_Aio_0x04[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
    {YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x04[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0,5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ib,   0, 8, 0, 10, },
	{YC_TYPE_Ic,   0, 9, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 10,  0, 10, },
	{YC_TYPE_Ib,   0, 11, 0, 10, },
	{YC_TYPE_Ic,   0, 12, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ib,   0, 14, 0, 10, },
	{YC_TYPE_Ic,   0, 15, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

	{YC_TYPE_Ia,   0, 16, 0, 10, },
	{YC_TYPE_Ib,   0, 17, 0, 10, },
	{YC_TYPE_Ic,   0, 18, 0, 10, },
	{YC_TYPE_SI0,  0, 20, 3, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x04[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x04[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
};



//0X05 4U15I,Ia,c,0
static struct VPAiCfg PAiCfg_Aio_0x05[] = 
{
    {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
    {YC_TYPE_U0,   0, 0, 0, 0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x05[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },

	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0,5, 0, 10, },
	{YC_TYPE_I0,   0, 6, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_I0,   0, 9, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 10,  0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_I0,   0, 12, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },

	{YC_TYPE_Ia,   0, 16, 0, 10, },
	{YC_TYPE_Ic,   0, 17, 0, 10, },
	{YC_TYPE_I0,   0, 18, 0, 10, },
	{YC_TYPE_SIb,  0, 20, 21, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x05[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x05[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
};

static struct VPAiCfg PAiCfg_Aio_0x06[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x06[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ic,   0, 1, 0, 10, },
	{YC_TYPE_I0,   0, 2, 0, 10, },
	{YC_TYPE_SIb,  0, 0, 1, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ic,   0, 4, 0, 10, },
	{YC_TYPE_I0,   0, 5, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },

	{YC_TYPE_Ia,   0, 15, 0, 10, },
	{YC_TYPE_Ic,   0, 16, 0, 10, },
	{YC_TYPE_I0,   0, 17, 0, 10, },
	{YC_TYPE_SIb,  0, 20, 21, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x06[] = 
{
    {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 106, 0x20, 220, 5, 10000, 600, 30, -1, 6, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x06[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",	  "Ia[%d]", 	"A",	 1,  0.0005},
	{"Ic[%d]",	  "Ic[%d]", 	"A",	 1,  0.0005},
	{"I0[%d]",	  "I0[%d]", 	"A",	 1,  0.0005},
	{"Ib[%d]",	  "Ib[%d]", 	"A",	 1,  0.0005},

};	


static struct VPAiCfg PAiCfg_Aio_0x4A[] = 
{
    {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x4A[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_I0,   0, 6, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_I0,   0, 9, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_I0,   0, 12, 0, 10, },
	{YC_TYPE_SIb,  0, 12,13, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
	{YC_TYPE_SIb,  0, 16,17, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x4A[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x4A[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
      
};	

static struct VPAiCfg PAiCfg_Aio_0x4B[] = 
{
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
	{YC_TYPE_Dc,   0, 0, 0,  0,},
};

static struct VPYcCfg PYcCfg_Aio_0x4B[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ia,   0, 0, 0, 10, },
	{YC_TYPE_Ic,   0, 1, 0, 10, },
	{YC_TYPE_I0,   0, 2, 0, 10, },
	{YC_TYPE_SIb,  0, 0, 1, 10, },

	{YC_TYPE_Ia,   0, 3, 0, 10, },
	{YC_TYPE_Ic,   0, 4, 0, 10, },
	{YC_TYPE_I0,   0, 5, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 6, 0, 10, },
	{YC_TYPE_Ic,   0, 7, 0, 10, },
	{YC_TYPE_I0,   0, 8, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 9,  0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },
	{YC_TYPE_SIb,  0, 12, 13, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ic,   0, 13, 0, 10, },
	{YC_TYPE_I0,   0, 14, 0, 10, },
	{YC_TYPE_SIb,  0, 16, 17, 10, },
};

static struct VPFdCfg PFdCfg_Aio_0x4B[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 105, 0x20, 220, 5, 10000, 600, 24, -1, 5, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x4B[] = 
{
	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

};	

// 0x48   6U4I
static struct VPAiCfg PAiCfg_Aio_0x48[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
		
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},

	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x48[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },
	{YC_TYPE_Ua,   0, 8, 0, 10, },
	{YC_TYPE_Uc,   0, 9, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x48[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x48[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"U1[%d]",    "U1[%d]",     "V",     1,  0.01},
	{"U2[%d]",    "U2[%d]",	    "V",     1,  0.01},
};	




// 0x68   6U4I
static struct VPAiCfg PAiCfg_Aio_0x68[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
		
	{YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},

	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
	{YC_TYPE_Null,   0, 0, 0, 0,},
};

static struct VPYcCfg PYcCfg_Aio_0x68[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,   0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },
	{YC_TYPE_Ua,   0, 8, 0, 10, },
	{YC_TYPE_Uc,   0, 9, 0, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x68[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x68[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"U1[%d]",    "U1[%d]",     "V",     1,  0.01},
	{"U2[%d]",    "U2[%d]",	    "V",     1,  0.01},
};	


//预留 0x41 兼容以前的0x41板子
static struct VPAiCfg PAiCfg_Aio_0x41[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x41[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_SI0,  0, 4, 3, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ib,   0, 8, 0, 10, },
	{YC_TYPE_Ic,   0, 9, 0, 10, },
	{YC_TYPE_SI0,  0, 8, 3, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ib,   0, 11, 0, 10, },
	{YC_TYPE_Ic,   0, 12, 0, 10, },
	{YC_TYPE_SI0,  0, 12, 3, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ib,   0, 14, 0, 10, },
	{YC_TYPE_Ic,   0, 15, 0, 10, },
	{YC_TYPE_SI0,  0, 16, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x41[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x41[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
      
};	

static struct VPAiCfg PAiCfg_Aio_0x51[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

};

static struct VPYcCfg PYcCfg_Aio_0x51[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ic,   0, 5, 0, 10, },
	{YC_TYPE_I0,   0, 6, 0, 10, },
	{YC_TYPE_SIb,  0, 4, 5, 10, },

	{YC_TYPE_Ia,   0, 7, 0, 10, },
	{YC_TYPE_Ic,   0, 8, 0, 10, },
	{YC_TYPE_I0,   0, 9, 0, 10, },
	{YC_TYPE_SIb,  0, 8, 9, 10, },

	{YC_TYPE_Ia,   0, 10, 0, 10, },
	{YC_TYPE_Ic,   0, 11, 0, 10, },
	{YC_TYPE_I0,   0, 12, 0, 10, },
	{YC_TYPE_SIb,  0, 12,13, 10, },

	{YC_TYPE_Ia,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 0, 10, },
	{YC_TYPE_SIb,  0, 16,17, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x51[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 104, 0x20, 220, 5, 10000, 600, 18, -1, 4, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x51[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",     "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
      
};	

static struct VPAiCfg PAiCfg_Aio_0x61[] = 
{
  {YC_TYPE_Ua,   0, 0, 0, 0,},
	{YC_TYPE_Ub,   0, 0, 0, 0,},
	{YC_TYPE_Uc,   0, 0, 0, 0,},
	{YC_TYPE_U0,   0, 0, 0, 0,},
		
	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},

	{YC_TYPE_Ia,   0, 0, 0,  0,},
	{YC_TYPE_Ib,   0, 0, 0,  0,},
	{YC_TYPE_Ic,   0, 0, 0,  0,},
	{YC_TYPE_I0,   0, 0, 0,  0,},
	
};

static struct VPYcCfg PYcCfg_Aio_0x61[] = 
{
    /*type, cfg, arg1, arg2, toZero, bak[5], rsv[5]*/
	{YC_TYPE_Ua,   0, 0, 0, 10, },
	{YC_TYPE_Ub,   0, 1, 0, 10, },
	{YC_TYPE_Uc,   0, 2, 0, 10, },
	{YC_TYPE_U0,  0, 3, 0, 10, },
	
	{YC_TYPE_Ia,   0, 4, 0, 10, },
	{YC_TYPE_Ib,   0, 5, 0, 10, },
	{YC_TYPE_Ic,   0, 6, 0, 10, },
	{YC_TYPE_I0,   0, 7, 0, 10, },

	{YC_TYPE_Ia,   0, 8, 0, 10, },
	{YC_TYPE_Ib,   0, 9, 0, 10, },
	{YC_TYPE_Ic,   0, 10, 0, 10, },
	{YC_TYPE_I0,   0, 11, 0, 10, },

	{YC_TYPE_Ia,   0, 12, 0, 10, },
	{YC_TYPE_Ib,   0, 13, 0, 10, },
	{YC_TYPE_Ic,   0, 14, 0, 10, },
	{YC_TYPE_I0,   0, 15, 3, 10, },

};

static struct VPFdCfg PFdCfg_Aio_0x61[] = 
{
  {"开关[%d]", 101, 0x20, 220, 5, 10000, 600, 0, -1, 1, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 102, 0x20, 220, 5, 10000, 600, 6, -1, 2, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},
	{"开关[%d]", 103, 0x20, 220, 5, 10000, 600, 12, -1, 3, -1, 0, 0, 0, 0, 5, 0, 600, -1, -1, -1, -1, 0, -1},

};

static VDefTVYcCfg PDefTVYcCfg_Aio_0x61[] = 
{
	{"Ua[%d]",    "Ua[%d]",     "V",     1,  0.01},
	{"Ub[%d]",    "Ub[%d]",     "V",     1,  0.01},
	{"Uc[%d]",    "Uc[%d]",     "V",     1,  0.01},
	{"U0[%d]",    "U0[%d]",    "V",     1,  0.01},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},

	{"Ia[%d]",    "Ia[%d]",     "A",     1,  0.0005},
	{"Ib[%d]",    "Ib[%d]",	    "A",     1,  0.0005},
	{"Ic[%d]",    "Ic[%d]",	    "A",     1,  0.0005},
	{"I0[%d]",    "I0[%d]",	    "A",     1,  0.0005},      
};	

#endif
#endif

static VDefAiCfg defMyAiCfg[] = 
{
#ifdef INCLUDE_YC
    {0x0, 0x0, 0, 0, 0, NULL, NULL, NULL, sizeof(PYcCfg_Aio_Public)/sizeof(PYcCfg_Aio_Public[0]), PYcCfg_Aio_Public,
    sizeof(PDefTVYcCfg_Aio)/sizeof(PDefTVYcCfg_Aio[0]), PDefTVYcCfg_Aio,
    sizeof(PDefTVYcCfg_Aio_Public)/sizeof(PDefTVYcCfg_Aio_Public[0]), PDefTVYcCfg_Aio_Public,
    sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,
    sizeof(PDefTVYxCfg_Aio_Public)/sizeof(PDefTVYxCfg_Aio_Public[0]), PDefTVYxCfg_Aio_Public,
    sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio, 
	sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
#if ((DEV_SP == DEV_SP_FTU)||(DEV_SP == DEV_SP_CTRL))
	{0x02, 0x01, 
	 sizeof(PAiCfg_Aio_0x02)/sizeof(PAiCfg_Aio_0x02[0]), sizeof(PYcCfg_Aio_0x02)/sizeof(PYcCfg_Aio_0x02[0]), sizeof(PFdCfg_Aio_0x02)/sizeof(PFdCfg_Aio_0x02[0]), 
	 PAiCfg_Aio_0x02, PYcCfg_Aio_0x02, PFdCfg_Aio_0x02, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x02)/sizeof(PDefTVYcCfg_Aio_0x02[0]), PDefTVYcCfg_Aio_0x02, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,  0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
#endif
#if (DEV_SP == DEV_SP_WDG)
	{0x03, 0x01, 
	 sizeof(PAiCfg_Aio_0x03)/sizeof(PAiCfg_Aio_0x03[0]), sizeof(PYcCfg_Aio_0x03)/sizeof(PYcCfg_Aio_0x03[0]), sizeof(PFdCfg_Aio_0x03)/sizeof(PFdCfg_Aio_0x03[0]), 
	 PAiCfg_Aio_0x03, PYcCfg_Aio_0x03, PFdCfg_Aio_0x03, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x03)/sizeof(PDefTVYcCfg_Aio_0x03[0]), PDefTVYcCfg_Aio_0x03, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,  0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	{0x04, 0x01, 
	 sizeof(PAiCfg_Aio_0x04)/sizeof(PAiCfg_Aio_0x04[0]), sizeof(PYcCfg_Aio_0x04)/sizeof(PYcCfg_Aio_0x04[0]), sizeof(PFdCfg_Aio_0x04)/sizeof(PFdCfg_Aio_0x04[0]), 
	 PAiCfg_Aio_0x04, PYcCfg_Aio_0x04, PFdCfg_Aio_0x04, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x04)/sizeof(PDefTVYcCfg_Aio_0x04[0]), PDefTVYcCfg_Aio_0x04, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,  0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

#endif
#if (DEV_SP == DEV_SP_TTU)
	{0x04, 0x00, 
	 sizeof(PAiCfg_Aio_0x04)/sizeof(PAiCfg_Aio_0x04[0]), sizeof(PYcCfg_Aio_0x04)/sizeof(PYcCfg_Aio_0x04[0]), sizeof(PFdCfg_Aio_0x04)/sizeof(PFdCfg_Aio_0x04[0]), 
	 PAiCfg_Aio_0x04, PYcCfg_Aio_0x04, PFdCfg_Aio_0x04, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x04)/sizeof(PDefTVYcCfg_Aio_0x04[0]), PDefTVYcCfg_Aio_0x04, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,  0, NULL, 
	 0, NULL,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
#endif
#if (DEV_SP == DEV_SP_DTU_IU)
	{0x08, 0x00, 
	 sizeof(PAiCfg_Aio_0x08)/sizeof(PAiCfg_Aio_0x08[0]), sizeof(PYcCfg_Aio_0x08)/sizeof(PYcCfg_Aio_0x08[0]), sizeof(PFdCfg_Aio_0x08)/sizeof(PFdCfg_Aio_0x08[0]), 
	 PAiCfg_Aio_0x08, PYcCfg_Aio_0x08, PFdCfg_Aio_0x08, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x08)/sizeof(PDefTVYcCfg_Aio_0x08[0]), PDefTVYcCfg_Aio_0x08, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio,  0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	
#endif
#if (DEV_SP == DEV_SP_DTU)
     {0x01, 0x7, 
	 sizeof(PAiCfg_Aio_0x01)/sizeof(PAiCfg_Aio_0x01[0]), sizeof(PYcCfg_Aio_0x01)/sizeof(PYcCfg_Aio_0x01[0]), sizeof(PFdCfg_Aio_0x01)/sizeof(PFdCfg_Aio_0x01[0]), 
	 PAiCfg_Aio_0x01, PYcCfg_Aio_0x01, PFdCfg_Aio_0x01, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x01)/sizeof(PDefTVYcCfg_Aio_0x01[0]), PDefTVYcCfg_Aio_0x01, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

		 {0x11, 0x7, 
	 sizeof(PAiCfg_Aio_0x11)/sizeof(PAiCfg_Aio_0x11[0]), sizeof(PYcCfg_Aio_0x11)/sizeof(PYcCfg_Aio_0x11[0]), sizeof(PFdCfg_Aio_0x11)/sizeof(PFdCfg_Aio_0x11[0]), 
	 PAiCfg_Aio_0x11, PYcCfg_Aio_0x11, PFdCfg_Aio_0x11, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x11)/sizeof(PDefTVYcCfg_Aio_0x11[0]), PDefTVYcCfg_Aio_0x11, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	   {0x21, 0x7, 
	 sizeof(PAiCfg_Aio_0x21)/sizeof(PAiCfg_Aio_0x21[0]), sizeof(PYcCfg_Aio_0x21)/sizeof(PYcCfg_Aio_0x21[0]), sizeof(PFdCfg_Aio_0x21)/sizeof(PFdCfg_Aio_0x21[0]), 
	 PAiCfg_Aio_0x21, PYcCfg_Aio_0x21, PFdCfg_Aio_0x21, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x21)/sizeof(PDefTVYcCfg_Aio_0x21[0]), PDefTVYcCfg_Aio_0x21, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

     {0x02, 0x7, 
	 sizeof(PAiCfg_Aio_0x02)/sizeof(PAiCfg_Aio_0x02[0]), sizeof(PYcCfg_Aio_0x02)/sizeof(PYcCfg_Aio_0x02[0]), sizeof(PFdCfg_Aio_0x02)/sizeof(PFdCfg_Aio_0x02[0]), 
	 PAiCfg_Aio_0x02, PYcCfg_Aio_0x02, PFdCfg_Aio_0x02, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x02)/sizeof(PDefTVYcCfg_Aio_0x02[0]), PDefTVYcCfg_Aio_0x02, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	  
	   {0x12, 0x7, 
	 sizeof(PAiCfg_Aio_0x12)/sizeof(PAiCfg_Aio_0x12[0]), sizeof(PYcCfg_Aio_0x12)/sizeof(PYcCfg_Aio_0x12[0]), sizeof(PFdCfg_Aio_0x12)/sizeof(PFdCfg_Aio_0x12[0]), 
	 PAiCfg_Aio_0x12, PYcCfg_Aio_0x12, PFdCfg_Aio_0x12, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x12)/sizeof(PDefTVYcCfg_Aio_0x12[0]), PDefTVYcCfg_Aio_0x12, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 
	    {0x22, 0x7, 
	 sizeof(PAiCfg_Aio_0x22)/sizeof(PAiCfg_Aio_0x22[0]), sizeof(PYcCfg_Aio_0x22)/sizeof(PYcCfg_Aio_0x22[0]), sizeof(PFdCfg_Aio_0x22)/sizeof(PFdCfg_Aio_0x22[0]), 
	 PAiCfg_Aio_0x22, PYcCfg_Aio_0x22, PFdCfg_Aio_0x22, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x22)/sizeof(PDefTVYcCfg_Aio_0x22[0]), PDefTVYcCfg_Aio_0x22, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 
     {0x03, 0x7, 
	 sizeof(PAiCfg_Aio_0x03)/sizeof(PAiCfg_Aio_0x03[0]), sizeof(PYcCfg_Aio_0x03)/sizeof(PYcCfg_Aio_0x03[0]), sizeof(PFdCfg_Aio_0x03)/sizeof(PFdCfg_Aio_0x03[0]), 
	 PAiCfg_Aio_0x03, PYcCfg_Aio_0x03, PFdCfg_Aio_0x03, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x03)/sizeof(PDefTVYcCfg_Aio_0x03[0]), PDefTVYcCfg_Aio_0x03, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

			{0x13, 0x7, 
	 sizeof(PAiCfg_Aio_0x13)/sizeof(PAiCfg_Aio_0x13[0]), sizeof(PYcCfg_Aio_0x13)/sizeof(PYcCfg_Aio_0x13[0]), sizeof(PFdCfg_Aio_0x13)/sizeof(PFdCfg_Aio_0x13[0]), 
	 PAiCfg_Aio_0x13, PYcCfg_Aio_0x13, PFdCfg_Aio_0x13, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x13)/sizeof(PDefTVYcCfg_Aio_0x13[0]), PDefTVYcCfg_Aio_0x13, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

			{0x23, 0x7, 
	 sizeof(PAiCfg_Aio_0x23)/sizeof(PAiCfg_Aio_0x23[0]), sizeof(PYcCfg_Aio_0x23)/sizeof(PYcCfg_Aio_0x23[0]), sizeof(PFdCfg_Aio_0x23)/sizeof(PFdCfg_Aio_0x23[0]), 
	 PAiCfg_Aio_0x23, PYcCfg_Aio_0x23, PFdCfg_Aio_0x23, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x23)/sizeof(PDefTVYcCfg_Aio_0x23[0]), PDefTVYcCfg_Aio_0x23, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
		{0x04, 0x7, 
	 sizeof(PAiCfg_Aio_0x04)/sizeof(PAiCfg_Aio_0x04[0]), sizeof(PYcCfg_Aio_0x04)/sizeof(PYcCfg_Aio_0x04[0]), sizeof(PFdCfg_Aio_0x04)/sizeof(PFdCfg_Aio_0x04[0]), 
	 PAiCfg_Aio_0x04, PYcCfg_Aio_0x04, PFdCfg_Aio_0x04, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x04)/sizeof(PDefTVYcCfg_Aio_0x04[0]), PDefTVYcCfg_Aio_0x04, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 
	 {0x41, 0x7, 
	 sizeof(PAiCfg_Aio_0x41)/sizeof(PAiCfg_Aio_0x41[0]), sizeof(PYcCfg_Aio_0x41)/sizeof(PYcCfg_Aio_0x41[0]), sizeof(PFdCfg_Aio_0x41)/sizeof(PFdCfg_Aio_0x41[0]), 
	 PAiCfg_Aio_0x41, PYcCfg_Aio_0x41, PFdCfg_Aio_0x41, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x41)/sizeof(PDefTVYcCfg_Aio_0x41[0]), PDefTVYcCfg_Aio_0x41, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x51, 0x7, 
	 sizeof(PAiCfg_Aio_0x51)/sizeof(PAiCfg_Aio_0x51[0]), sizeof(PYcCfg_Aio_0x51)/sizeof(PYcCfg_Aio_0x51[0]), sizeof(PFdCfg_Aio_0x51)/sizeof(PFdCfg_Aio_0x51[0]), 
	 PAiCfg_Aio_0x51, PYcCfg_Aio_0x51, PFdCfg_Aio_0x51, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x51)/sizeof(PDefTVYcCfg_Aio_0x51[0]), PDefTVYcCfg_Aio_0x51, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x61, 0x7, 
	 sizeof(PAiCfg_Aio_0x61)/sizeof(PAiCfg_Aio_0x61[0]), sizeof(PYcCfg_Aio_0x61)/sizeof(PYcCfg_Aio_0x61[0]), sizeof(PFdCfg_Aio_0x61)/sizeof(PFdCfg_Aio_0x61[0]), 
	 PAiCfg_Aio_0x61, PYcCfg_Aio_0x61, PFdCfg_Aio_0x61, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x61)/sizeof(PDefTVYcCfg_Aio_0x61[0]), PDefTVYcCfg_Aio_0x61, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 
	 {0x42, 0x7, 
	 sizeof(PAiCfg_Aio_0x42)/sizeof(PAiCfg_Aio_0x42[0]), sizeof(PYcCfg_Aio_0x42)/sizeof(PYcCfg_Aio_0x42[0]), sizeof(PFdCfg_Aio_0x42)/sizeof(PFdCfg_Aio_0x42[0]), 
	 PAiCfg_Aio_0x42, PYcCfg_Aio_0x42, PFdCfg_Aio_0x42, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x42)/sizeof(PDefTVYcCfg_Aio_0x42[0]), PDefTVYcCfg_Aio_0x42, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x52, 0x7, 
	 sizeof(PAiCfg_Aio_0x52)/sizeof(PAiCfg_Aio_0x52[0]), sizeof(PYcCfg_Aio_0x52)/sizeof(PYcCfg_Aio_0x52[0]), sizeof(PFdCfg_Aio_0x52)/sizeof(PFdCfg_Aio_0x52[0]), 
	 PAiCfg_Aio_0x52, PYcCfg_Aio_0x52, PFdCfg_Aio_0x52, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x52)/sizeof(PDefTVYcCfg_Aio_0x52[0]), PDefTVYcCfg_Aio_0x52, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 
	 {0x62, 0x7, 
	 sizeof(PAiCfg_Aio_0x62)/sizeof(PAiCfg_Aio_0x62[0]), sizeof(PYcCfg_Aio_0x62)/sizeof(PYcCfg_Aio_0x62[0]), sizeof(PFdCfg_Aio_0x62)/sizeof(PFdCfg_Aio_0x62[0]), 
	 PAiCfg_Aio_0x62, PYcCfg_Aio_0x62, PFdCfg_Aio_0x62, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x62)/sizeof(PDefTVYcCfg_Aio_0x62[0]), PDefTVYcCfg_Aio_0x62, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x43, 0x7, 
	 sizeof(PAiCfg_Aio_0x43)/sizeof(PAiCfg_Aio_0x43[0]), sizeof(PYcCfg_Aio_0x43)/sizeof(PYcCfg_Aio_0x43[0]), sizeof(PFdCfg_Aio_0x43)/sizeof(PFdCfg_Aio_0x43[0]), 
	 PAiCfg_Aio_0x43, PYcCfg_Aio_0x43, PFdCfg_Aio_0x43, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x43)/sizeof(PDefTVYcCfg_Aio_0x43[0]), PDefTVYcCfg_Aio_0x43, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x53, 0x7, 
	 sizeof(PAiCfg_Aio_0x53)/sizeof(PAiCfg_Aio_0x53[0]), sizeof(PYcCfg_Aio_0x53)/sizeof(PYcCfg_Aio_0x53[0]), sizeof(PFdCfg_Aio_0x53)/sizeof(PFdCfg_Aio_0x53[0]), 
	 PAiCfg_Aio_0x53, PYcCfg_Aio_0x53, PFdCfg_Aio_0x53, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x53)/sizeof(PDefTVYcCfg_Aio_0x53[0]), PDefTVYcCfg_Aio_0x53, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x63, 0x7, 
	 sizeof(PAiCfg_Aio_0x63)/sizeof(PAiCfg_Aio_0x63[0]), sizeof(PYcCfg_Aio_0x63)/sizeof(PYcCfg_Aio_0x63[0]), sizeof(PFdCfg_Aio_0x63)/sizeof(PFdCfg_Aio_0x63[0]), 
	 PAiCfg_Aio_0x63, PYcCfg_Aio_0x63, PFdCfg_Aio_0x63, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x63)/sizeof(PDefTVYcCfg_Aio_0x63[0]), PDefTVYcCfg_Aio_0x63, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x44, 0x7, 
	 sizeof(PAiCfg_Aio_0x44)/sizeof(PAiCfg_Aio_0x44[0]), sizeof(PYcCfg_Aio_0x44)/sizeof(PYcCfg_Aio_0x44[0]), sizeof(PFdCfg_Aio_0x44)/sizeof(PFdCfg_Aio_0x44[0]), 
	 PAiCfg_Aio_0x44, PYcCfg_Aio_0x44, PFdCfg_Aio_0x44, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x44)/sizeof(PDefTVYcCfg_Aio_0x44[0]), PDefTVYcCfg_Aio_0x44, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
   
	 {0x54, 0x7, 
	 sizeof(PAiCfg_Aio_0x54)/sizeof(PAiCfg_Aio_0x54[0]), sizeof(PYcCfg_Aio_0x54)/sizeof(PYcCfg_Aio_0x54[0]), sizeof(PFdCfg_Aio_0x54)/sizeof(PFdCfg_Aio_0x54[0]), 
	 PAiCfg_Aio_0x54, PYcCfg_Aio_0x54, PFdCfg_Aio_0x54, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x54)/sizeof(PDefTVYcCfg_Aio_0x54[0]), PDefTVYcCfg_Aio_0x54, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x64, 0x7, 
	 sizeof(PAiCfg_Aio_0x64)/sizeof(PAiCfg_Aio_0x64[0]), sizeof(PYcCfg_Aio_0x64)/sizeof(PYcCfg_Aio_0x64[0]), sizeof(PFdCfg_Aio_0x64)/sizeof(PFdCfg_Aio_0x64[0]), 
	 PAiCfg_Aio_0x64, PYcCfg_Aio_0x64, PFdCfg_Aio_0x64, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x64)/sizeof(PDefTVYcCfg_Aio_0x64[0]), PDefTVYcCfg_Aio_0x64, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

     {0x65, 0x7, 
	 sizeof(PAiCfg_Aio_0x65)/sizeof(PAiCfg_Aio_0x65[0]), sizeof(PYcCfg_Aio_0x65)/sizeof(PYcCfg_Aio_0x65[0]), sizeof(PFdCfg_Aio_0x65)/sizeof(PFdCfg_Aio_0x65[0]), 
	 PAiCfg_Aio_0x65, PYcCfg_Aio_0x65, PFdCfg_Aio_0x65, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x65)/sizeof(PDefTVYcCfg_Aio_0x65[0]), PDefTVYcCfg_Aio_0x65, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x45, 0x7, 
	 sizeof(PAiCfg_Aio_0x45)/sizeof(PAiCfg_Aio_0x45[0]), sizeof(PYcCfg_Aio_0x45)/sizeof(PYcCfg_Aio_0x45[0]), sizeof(PFdCfg_Aio_0x45)/sizeof(PFdCfg_Aio_0x45[0]), 
	 PAiCfg_Aio_0x45, PYcCfg_Aio_0x45, PFdCfg_Aio_0x45, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x45)/sizeof(PDefTVYcCfg_Aio_0x45[0]), PDefTVYcCfg_Aio_0x45, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 
	 {0x46, 0x7, 
	 sizeof(PAiCfg_Aio_0x46)/sizeof(PAiCfg_Aio_0x46[0]), sizeof(PYcCfg_Aio_0x46)/sizeof(PYcCfg_Aio_0x46[0]), 0, 
	 PAiCfg_Aio_0x46, PYcCfg_Aio_0x46, NULL, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x46)/sizeof(PDefTVYcCfg_Aio_0x46[0]), PDefTVYcCfg_Aio_0x46, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	 {0x47, 0x7, 
	 sizeof(PAiCfg_Aio_0x47)/sizeof(PAiCfg_Aio_0x47[0]), sizeof(PYcCfg_Aio_0x47)/sizeof(PYcCfg_Aio_0x47[0]), sizeof(PFdCfg_Aio_0x47)/sizeof(PFdCfg_Aio_0x47[0]), 
	 PAiCfg_Aio_0x47, PYcCfg_Aio_0x47, PFdCfg_Aio_0x47, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x47)/sizeof(PDefTVYcCfg_Aio_0x47[0]), PDefTVYcCfg_Aio_0x47, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
	 {0x49, 0x7, 
	 sizeof(PAiCfg_Aio_0x49)/sizeof(PAiCfg_Aio_0x49[0]), sizeof(PYcCfg_Aio_0x49)/sizeof(PYcCfg_Aio_0x49[0]), sizeof(PFdCfg_Aio_0x49)/sizeof(PFdCfg_Aio_0x49[0]), 
	 PAiCfg_Aio_0x49, PYcCfg_Aio_0x49, PFdCfg_Aio_0x49, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x49)/sizeof(PDefTVYcCfg_Aio_0x49[0]), PDefTVYcCfg_Aio_0x49, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	{0x05, 0x7, 
	 sizeof(PAiCfg_Aio_0x05)/sizeof(PAiCfg_Aio_0x05[0]), sizeof(PYcCfg_Aio_0x05)/sizeof(PYcCfg_Aio_0x05[0]), sizeof(PFdCfg_Aio_0x05)/sizeof(PFdCfg_Aio_0x05[0]), 
	 PAiCfg_Aio_0x05, PYcCfg_Aio_0x05, PFdCfg_Aio_0x05, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x05)/sizeof(PDefTVYcCfg_Aio_0x05[0]), PDefTVYcCfg_Aio_0x05, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	{0x06, 0x7, 
	 sizeof(PAiCfg_Aio_0x06)/sizeof(PAiCfg_Aio_0x06[0]), sizeof(PYcCfg_Aio_0x06)/sizeof(PYcCfg_Aio_0x06[0]), sizeof(PFdCfg_Aio_0x06)/sizeof(PFdCfg_Aio_0x06[0]), 
	 PAiCfg_Aio_0x06, PYcCfg_Aio_0x06, PFdCfg_Aio_0x06, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x06)/sizeof(PDefTVYcCfg_Aio_0x06[0]), PDefTVYcCfg_Aio_0x06, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	{0x4A, 0x7, 
	 sizeof(PAiCfg_Aio_0x4A)/sizeof(PAiCfg_Aio_0x4A[0]), sizeof(PYcCfg_Aio_0x4A)/sizeof(PYcCfg_Aio_0x4A[0]), sizeof(PFdCfg_Aio_0x4A)/sizeof(PFdCfg_Aio_0x4A[0]), 
	 PAiCfg_Aio_0x4A, PYcCfg_Aio_0x4A, PFdCfg_Aio_0x4A, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x4A)/sizeof(PDefTVYcCfg_Aio_0x4A[0]), PDefTVYcCfg_Aio_0x4A, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

	{0x4B, 0x7, 
	 sizeof(PAiCfg_Aio_0x4B)/sizeof(PAiCfg_Aio_0x4B[0]), sizeof(PYcCfg_Aio_0x4B)/sizeof(PYcCfg_Aio_0x4B[0]), sizeof(PFdCfg_Aio_0x4B)/sizeof(PFdCfg_Aio_0x4B[0]), 
	 PAiCfg_Aio_0x4B, PYcCfg_Aio_0x4B, PFdCfg_Aio_0x4B, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x4B)/sizeof(PDefTVYcCfg_Aio_0x4B[0]), PDefTVYcCfg_Aio_0x4B, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
 
	 {0x48, 0x7, 
	 sizeof(PAiCfg_Aio_0x48)/sizeof(PAiCfg_Aio_0x48[0]), sizeof(PYcCfg_Aio_0x48)/sizeof(PYcCfg_Aio_0x48[0]), sizeof(PFdCfg_Aio_0x48)/sizeof(PFdCfg_Aio_0x48[0]), 
	 PAiCfg_Aio_0x48, PYcCfg_Aio_0x48, PFdCfg_Aio_0x48, 
	 0, NULL, 
	 sizeof(PDefTVYcCfg_Aio_0x48)/sizeof(PDefTVYcCfg_Aio_0x48[0]), PDefTVYcCfg_Aio_0x48, 
	 0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
	 sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},

     {0x68, 0x7, 
     sizeof(PAiCfg_Aio_0x68)/sizeof(PAiCfg_Aio_0x68[0]), sizeof(PYcCfg_Aio_0x68)/sizeof(PYcCfg_Aio_0x68[0]), sizeof(PFdCfg_Aio_0x68)/sizeof(PFdCfg_Aio_0x68[0]), 
     PAiCfg_Aio_0x68, PYcCfg_Aio_0x68, PFdCfg_Aio_0x68, 
     0, NULL, 
     sizeof(PDefTVYcCfg_Aio_0x68)/sizeof(PDefTVYcCfg_Aio_0x68[0]), PDefTVYcCfg_Aio_0x68, 
     0, NULL, sizeof(PDefTVDdCfg_Aio)/sizeof(PDefTVDdCfg_Aio[0]), PDefTVDdCfg_Aio, 0, NULL, 
     sizeof(PDefTVYxCfg_Fd_Aio)/sizeof(PDefTVYxCfg_Fd_Aio[0]), PDefTVYxCfg_Fd_Aio,  sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
#endif
#elif defined INCLUDE_EXT_YC
    {0x0, 0x0, 0, 0, 0, NULL, NULL, NULL, sizeof(PYcCfg_Aio_Public)/sizeof(PYcCfg_Aio_Public[0]), PYcCfg_Aio_Public,
    sizeof(PDefTVYcCfg_Aio)/sizeof(PDefTVYcCfg_Aio[0]), PDefTVYcCfg_Aio,
    sizeof(PDefTVYcCfg_Aio_Public)/sizeof(PDefTVYcCfg_Aio_Public[0]), PDefTVYcCfg_Aio_Public,
    0, NULL,
    0, NULL,
    0, NULL, 
	sizeof(PDefTVYkCfg_Fd_Aio)/sizeof(PDefTVYkCfg_Fd_Aio[0]), PDefTVYkCfg_Fd_Aio},
#endif
	{(DWORD)-1, 0,  0,  0,  0, NULL, NULL, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL, 0, NULL},
};		

VDefAiCfg *GetDefAiCfg(DWORD type)
{
	VDefAiCfg *pcfg = defMyAiCfg;

    while (pcfg->ext_type != (DWORD)-1)
    {
		if (pcfg->ext_type == type) break;
		pcfg++;
	}

    if (pcfg->ext_type == (DWORD)-1)  return NULL;
	else return pcfg;
}

int GetAdCfg(DWORD type, DWORD *pAdMask, int *pChnNum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

	if (pcfg != NULL) 
	{
		*pAdMask = pcfg->admask;
		*pChnNum = pcfg->ainum;
		return OK;
	}
	else
	{
		*pAdMask = 0;
		*pChnNum = 0;
		return ERROR;	
	}	
}

int GetDefPAiCfg(DWORD type, WORD ainum, struct VPAiCfg *pPCfg)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

	if (pcfg != NULL) 
	{
		memcpy(pPCfg, pcfg->paicfg, sizeof(struct VPAiCfg)*ainum);
		return OK;		
	}
	else
		return ERROR;
}


int GetDefPYcCfg(DWORD type, WORD ycnum, struct VPYcCfg *pPCfg)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

	if (pcfg != NULL) 
	{
		memcpy(pPCfg, pcfg->pyccfg, sizeof(struct VPYcCfg)*ycnum);
		return OK;		
	}
	else
		return ERROR;
}

int GetDefPYcCfg_Public(DWORD type, WORD ycnum_public, struct VPYcCfg *pPCfg)
{
    VDefAiCfg *pcfg = GetDefAiCfg(type);

	if (pcfg != NULL) 
	{
		memcpy(pPCfg, pcfg->pyccfg_public, sizeof(struct VPYcCfg)*ycnum_public);
		return OK;		
	}
	else
		return ERROR;
}

int GetDefPFdCfg(DWORD type, WORD fdnum, struct VPFdCfg *pPCfg)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

	if (pcfg != NULL) 
	{
		memcpy(pPCfg, pcfg->pfdcfg, sizeof(struct VPFdCfg)*fdnum);
		return OK;		
	}
	else
		return ERROR;
}

VDefTVYcCfg *GetDefTVYcCfg(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
        *pnum = 0;
		return NULL;
    }	
	else
	{
        *pnum = pcfg->tvyccfgnum;
		return(pcfg->ptvyccfg);
	}
}

VDefTVYcCfg *GetDefTVYcCfg_Public(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
        *pnum = 0;
		return NULL;
    }	
	else
	{
        *pnum = pcfg->tvyccfgnum_public;
		return(pcfg->ptvyccfg_public);
	}
}

VDefTVDdCfg *GetDefTVDdCfg(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
        *pnum = 0;
		return NULL;
    }	
	else
	{
#ifdef	INCLUDE_DD
        *pnum = pcfg->tvddcfgnum;
		return(pcfg->ptvddcfg);
#else
		*pnum = 0;
		return NULL;
#endif
	}
}

VDefTVYxCfg_Fd *GetDefTVYxCfg_FdPublic(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
        *pnum = 0;
		return NULL;
    }	
	else
	{
        *pnum = pcfg->tvyxcfgnum_public;
		return(pcfg->ptvyxcfg_public);
	}
}

VDefTVYxCfg_Fd *GetDefTVYxCfg_Fd(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
		*pnum = 0;
		return NULL;
    }	
	else
	{
		*pnum = pcfg->tvyxcfgnum_fd;
		return(pcfg->ptvyxcfg_fd);
	}
}

VDefTVYkCfg_Fd *GetDefTVYkCfg_Fd(DWORD type, int *pnum)
{
	VDefAiCfg *pcfg = GetDefAiCfg(type);

    if (pcfg == NULL) 
	{
		*pnum = 0;
		return NULL;
    }	
	else
	{
		*pnum = pcfg->tvykcfgnum_fd;
		return(pcfg->ptvykcfg_fd);
	}
}


